Autodesk.Revit.DB.BuiltInFailures.AlignmentFailures.AlignmentCheckStationLabels
A change to an Infrastructure Alignment or its Stationing Units may have affected the associated Alignment Station Labels.
Please check the labels to ensure proper placement.

Autodesk.Revit.DB.BuiltInFailures.AlignmentFailures
Failures related to alignment elements and annotations.